In [1]:
import pandas as pd
import numpy as np

In [2]:
movie_data = pd.read_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\Movies.csv',error_bad_lines=False, header=0, usecols=[0,1,3] ,index_col=0, names=['movieId', 'Title','Genre'])
movie_data.head()

                   Title      Genre
movieId
2769         Yards, The       Crime
3177        Next Friday      Comedy
3190          Supernova   Adventure
3225        Down to You      Comedy
3228     Wirey Spindell      Comedy

In [3]:
movie_data.describe()

        Title   Genre
count   10682   10682
unique   9984      16
top     Home   Comedy
freq        7    3204

In [4]:

movie_ratings = pd.read_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\Ratings.csv', error_bad_lines=False, usecols=[0,1,2],header=0, names=['userId','movieId', 'rating'] )
movie_ratings.head()

   userId  movieId  rating
0       1     3893     3.5
1       1     3826     2.0
2       4     3578     5.0
3       4     4034     5.0
4       4     4226     5.0

In [5]:
movie_ratings.describe()

              userId        movieId         rating
count  374710.000000  374710.000000  374710.000000
mean     5293.813085   47900.775979       3.491383
std      3034.437774   45719.171694       1.068768
min         1.000000    2769.000000       0.500000
25%      2606.000000    5810.000000       3.000000
50%      5277.000000   41566.000000       3.500000
75%      7968.000000   79357.000000       4.000000
max     10532.000000  193843.000000       5.000000

In [6]:

def movieTitle(movieId):
    title = movie_data.at[movieId, 'Title']
    return title
movieTitle(2769)

'Yards, The '

In [7]:

def movieGenre(movieId):  
    genre = movie_data.at[movieId, 'Genre']
    return  genre
movieGenre(2769)

'Crime'

In [8]:
def favMovie(userId, N):
    userRatings = movie_ratings[movie_ratings.userId==userId]
    sortedRatings = pd.DataFrame.sort_values(userRatings,['rating'] ,ascending=[0])[:N]
    sortedRatings['Title'] = sortedRatings['movieId'].apply(movieTitle)
    sortedRatings['Genre'] = sortedRatings['movieId'].apply(movieGenre)
    return sortedRatings
favMovie(1, 10)

   userId  movieId  rating         Title   Genre
0       1     3893     3.5  Nurse Betty   Comedy
1       1     3826     2.0   Hollow Man   Horror

In [9]:
movie_ratings.shape, movie_data.shape

((374710, 3), (10682, 2))

In [10]:
userPerMovieID = movie_ratings.movieId.value_counts()
userPerMovieID.head()

4993    2265
7153    2101
5952    2077
3578    1770
4306    1732
Name: movieId, dtype: int64

In [11]:
userPerMovieID.shape

(12181,)

In [12]:
userMovieRatingMatrix = pd.pivot_table(movie_ratings, index=['userId'],columns=['movieId'] ,values='rating')
userMovieRatingMatrix.head(10)

movieId,2769,3177,3190,3225,3228,3239,3273,3275,3276,3279,...,193277,193279,193281,193421,193429,193431,193595,193599,193793,193843
userId,,,,,,,,,,,,,,,,,,,,,
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,3.5,NaN,NaN,NaN,NaN,4.5,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,4.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
user1 = 100
user2 = 200

user1_ratings = userMovieRatingMatrix.transpose()[user1]
user1_ratings.head()

movieId
2769   NaN
3177   NaN
3190   NaN
3225   NaN
3228   NaN
Name: 100, dtype: float64

In [14]:
user2_ratings = userMovieRatingMatrix.transpose()[user2]
user2_ratings.head()

movieId
2769   NaN
3177   NaN
3190   NaN
3225   NaN
3228   NaN
Name: 200, dtype: float64

In [15]:
from scipy.spatial.distance import hamming
hamming(user1_ratings, user1_ratings)

0.9844019374435596

In [16]:
def distance(user1, user2):
    try:
        user1_ratings = userMovieRatingMatrix.transpose()[user1]
        user2_ratings = userMovieRatingMatrix.transpose()[user2]
        distance = hamming(user1_ratings, user2_ratings)
    except:
        distance = np.nan
    return distance
distance(100,200)

1.0

In [17]:
user = 1
allusers = pd.DataFrame(userMovieRatingMatrix.index)
allusers = allusers[allusers.userId != user]
allusers.head()

   userId
1       4
2       5
3       7
4      11
5      12

In [18]:
allusers['distance'] = allusers['userId'].apply(lambda x: distance(user, x))
allusers.head()

   userId  distance
1       4       1.0
2       5       1.0
3       7       1.0
4      11       1.0
5      12       1.0

In [19]:
K = 10
KNearestUsers = allusers.sort_values(['distance'], ascending=True)['userId'][:K]
KNearestUsers

2423    3846
874     1400
1425    2273
299      458
5680    8912
795     1281
4671    7348
3458    5424
2354    3733
2783    4397
Name: userId, dtype: int64

In [20]:
def nearestNeighbours(user, K=10):
    allusers = pd.DataFrame(userMovieRatingMatrix.index)
    allusers = allusers[allusers.userId != user]
    allusers['distance'] = allusers['userId'].apply(lambda x: distance(user, x))
    KNearestUsers = allusers.sort_values(['distance'], ascending=True)['userId'][:K]
    return KNearestUsers

KNearestNeighbours = nearestNeighbours(1,5)
KNearestNeighbours

2423    3846
874     1400
1425    2273
299      458
5680    8912
Name: userId, dtype: int64

In [21]:
NNratings = userMovieRatingMatrix[userMovieRatingMatrix.index.isin(KNearestNeighbours)]
NNratings

movieId,2769,3177,3190,3225,3228,3239,3273,3275,3276,3279,...,193277,193279,193281,193421,193429,193431,193595,193599,193793,193843
userId,,,,,,,,,,,,,,,,,,,,,
458,NaN,NaN,NaN,NaN,NaN,NaN,0.5,4.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1400,NaN,NaN,NaN,NaN,NaN,NaN,3.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2273,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3846,NaN,3.0,NaN,NaN,NaN,NaN,NaN,4.0,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8912,NaN,NaN,NaN,NaN,NaN,NaN,3.0,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [22]:
avgRating = NNratings.apply(np.nanmean).dropna()
avgRating.head()

C:\Users\Abhishek\Anaconda3\lib\site-packages\pandas\core\apply.py:285: RuntimeWarning: Mean of empty slice
  values, self.f, axis=self.axis, dummy=dummy, labels=labels

movieId
3177    3.000000
3273    2.166667
3275    4.000000
3285    4.000000
3298    3.750000
dtype: float64

In [23]:
moviesAlreadySeen = userMovieRatingMatrix.transpose()[user].dropna().index
moviesAlreadySeen

Int64Index([3826, 3893], dtype='int64', name='movieId')

In [24]:
avgRating = avgRating[~avgRating.index.isin(moviesAlreadySeen)]

In [25]:
N=3
topNMovieId = avgRating.sort_values(ascending=False).index[:N]
topNMovieId

Int64Index([68522, 99764, 112556], dtype='int64', name='movieId')

In [26]:
pd.Series(topNMovieId).apply(movieTitle)

0                        Earth
1    It's Such a Beautiful Day
2                     Gone Girl
Name: movieId, dtype: object

In [27]:
pd.Series(topNMovieId).apply(movieGenre)

0    Documentary
1         Comedy
2       Thriller
Name: movieId, dtype: object

In [28]:
def topN(user,N=3):
    KnearestUsers = nearestNeighbours(user)
    NNRatings = userMovieRatingMatrix[userMovieRatingMatrix.index.isin(KnearestUsers)]
    avgRating = NNRatings.apply(np.nanmean).dropna()
    moviesAlreadySeen = userMovieRatingMatrix.transpose()[user].dropna().index
    avgRating = avgRating[~avgRating.index.isin(moviesAlreadySeen)]
    topNMovieId = avgRating.sort_values(ascending=False).index[:N]
    return pd.DataFrame({'Movie':pd.Series(topNMovieId).apply(movieTitle), 'Genre':pd.Series(topNMovieId).apply(movieGenre)})

In [29]:
favMovie(4,5)

    userId  movieId  rating                   Title   Genre
2        4     3578     5.0              Gladiator   Action
28       4    31184     5.0              Appleseed   Action
22       4     8665     5.0  Bourne Supremacy, The   Action
23       4     8874     5.0      Shaun of the Dead   Comedy
24       4     8914     5.0                 Primer    Drama

In [30]:
favMovie(5,5)

     userId  movieId  rating                                   Title    Genre
244       5     4226     5.0                                Memento   Mystery
246       5     5995     5.0                           Pianist, The     Drama
247       5     6016     5.0                            City of God    Action
248       5     7361     5.0  Eternal Sunshine of the Spotless Mind     Drama
249       5    44195     5.0                  Thank You for Smoking    Comedy

In [31]:
import warnings
warnings.filterwarnings("ignore", category=RuntimeWarning) 

topN(1,5)

                       Movie      Genre
0                Apocalypto   Adventure
1     Shadow of the Vampire       Drama
2  Grand Budapest Hotel, The      Drama
3    Constant Gardener, The       Drama
4                   Pollock       Drama

In [32]:
import warnings
warnings.filterwarnings("ignore", category=RuntimeWarning) 

topN(1,5)

                       Movie      Genre
0                Apocalypto   Adventure
1     Shadow of the Vampire       Drama
2  Grand Budapest Hotel, The      Drama
3    Constant Gardener, The       Drama
4                   Pollock       Drama

In [33]:
from IPython.display import FileLink, FileLinks

In [34]:
topN(1,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output.csv',index=False)

In [35]:
topN(4,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output1.csv',index=False)

In [36]:
topN(5,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output2.csv',index=False)

In [37]:
topN(7,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output3.csv',index=False)

In [38]:
topN(11,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output4.csv',index=False)

In [39]:
topN(12,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output5.csv',index=False)

In [40]:
topN(13,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output6.csv',index=False)

In [41]:
topN(14,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output7.csv',index=False)

In [42]:
topN(15,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output8.csv',index=False)

In [43]:
topN(20,5).to_csv(r'C:\Users\Abhishek\Desktop\DCU\Cloud Computing\Assignment 2\output9.csv',index=False)